Revit 2026 API

# VirtualPrinterType Enumeration

---

An enumerated to list Virtual Printer Types in Revit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum VirtualPrinterType
```
```vb
Public Enumeration VirtualPrinterType
```
```cpp
public enum class VirtualPrinterType
```
```fsharp
type VirtualPrinterType
```

| Member name | Value | Description |
| --- | --- | --- |
| AdobePDF | 1 | AdobePDF. |
| DWFWriter | 2 | DWFWriter. |
| None | 0 | None. |
| XPSWriter | 3 | Microsoft XPS Document Writer. |

#### Reference

Autodesk.Revit.DB Namespace